app/controllers/lastfm_controller.rb

SELECT "album_arts".* FROM "album_arts" WHERE "album_arts"."artist" = 'guided by voices' AND "album_arts"."album" = 'bee thousand' AND "album_arts"."size" = 'small' LIMIT 1
INSERT INTO "album_arts" ("album", "artist", "created_at", "data", "size", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def albumart

    params[:size] = "mega" if params[:size].nil?
    params[:opacity] = 0 if params[:opacity].nil?

    art = AlbumArt.find_by(artist: params[:artist], album: params[:album], size: params[:size])

    if art.nil? then #need to get from lastfm

        result = LastFM::Album.get_info(artist: params[:artist], album: params[:album])
        if not result['error'].nil?
            render :nothing => true, :status => 404
            return
        end

        img_url = result['album']['image'].select { |i| i['size']==params[:size] }.first['#text']
        if img_url.nil? then
            render :nothing => true, :status => 404
            return
        end
        #download image
        begin
            data = Net::HTTP.get URI(img_url)
            art = AlbumArt.create(artist: params[:artist], album: params[:album], size: params[:size], url: img_url, data: data)